[
  {
    "url": "https://www.bbc.com/news/topics/c2vdnvdg6xxt",
    "title": "Israel Gaza war | Latest News & Updates | BBC News",
    "body": "Edan Alexander, 21, is believed to be the last living captive with US nationality in Gaza. UN agencies say they will not co-operate with the proposed system because it appears to \"weaponise\" aid. The action, which affects hundreds of Palestinian pupils, comes after an Israeli ban on Unrwa this year. The restaurant in Gaza City's Rimal neighbourhood had been recently been operating a community kitchen. The UN also expresses alarm after Israel approves a new plan that may include seizing all of Gaza indefinitely and controlling aid. UN agencies say they will not co-operate with the proposed system because it appears to \"weaponise\" aid. Benjamin Netanyahu said he knew \"with certainty\" that 21 hostages were alive but the status of \"three more\" were unclear. The action, which affects hundreds of Palestinian pupils, comes after an Israeli ban on Unrwa this year. The mineral, once widely-used, releases toxic fibres into the air when disturbed that can cling to the lungs and cause cancer. The truce was already in trouble - now Israeli air strikes have dealt it a huge blow.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:09.986069"
  },
  {
    "url": "https://www.bbc.com/news/war-in-ukraine",
    "title": "Ukraine War | Latest News & Updates| BBC News",
    "body": "\"I will be waiting for Putin in Türkiye on Thursday. Personally,\" the Ukrainian leader writes after Trump urged him to \"have the meeting, now!\" This was clearly his response to the ultimatum set by European leaders in Kyiv, the BBC's Russia Editor writes. Some 350 flights are affected in Moscow and other cities, as Russia claims shooting down 524 Ukrainian drones. Last year was the deadliest for Russian forces since the start of the full-scale war with at least 45,287 killed. The White House has been pushing for the agreement as a prerequisite for further military assistance.  This was clearly his response to the ultimatum set by European leaders in Kyiv, the BBC's Russia Editor writes. France, Britain, Germany and Poland met President Vlodomyr Zelensky to discuss an unconditional ceasefire.  Putin used his speech to tie Russia's three-year war in Ukraine to the war against Nazi Germany 80 years ago. Some 350 flights are affected in Moscow and other cities, as Russia claims shooting down 524 Ukrainian drones. Neither Putin nor Zelensky want to be seen by Trump as the obstacle to peace, writes Frank Gardner.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:10.571444"
  },
  {
    "url": "https://www.bbc.com/news/us-canada",
    "title": "US & Canada | Latest News & Updates | BBC News",
    "body": "The US treasury secretary calls the talks \"productive\", while China's vice premier describes them as \"candid\". Economic pressures are forcing Donald Trump and Xi Jinping to seek an off-ramp in the trade war. Sovereignty won the Kentucky Derby, beating favourite Journalism. It is a safeguard against unlawful imprisonment - but the White House is \"actively looking\" at pausing it. The directive is part of his administration's drive to incentivise illegal immigrants to self-deport. Economic pressures are forcing Donald Trump and Xi Jinping to seek an off-ramp in the trade war. As the president goes to Saudi Arabia, Qatar and the UAE he wants them to buy more from the States. The Liberal Party will hold 170 seats in the House of Commons, 2 seats shy of a majority. Sovereignty won the Kentucky Derby, beating favourite Journalism. Chicago-born Robert Prevost, 69, is the first North American to be elected pontiff. ",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:11.142146"
  },
  {
    "url": "https://www.bbc.com/news/uk",
    "title": "UK | Latest News & Updates | BBC News",
    "body": "Proposed changes include English tests and cuts to recruitment of overseas care workers, as Tory leader Kemi Badenoch says Labour \"can't be trusted\" to protect UK borders. The government says its proposals will reduce record levels of migration to the UK in recent years. Scientists test Mounjaro and Wegovy - the big beasts of weight loss medication - to see which is best. ITV's dramatisation of the Post Office scandal was among the winners on a night with several surprises. Experts say a major challenge was getting the public used to the idea that elk \"should be here\". The government says its proposals will reduce record levels of migration to the UK in recent years. Veterans who served with the SAS and SBS give BBC Panorama eyewitness accounts of alleged executions. Owen Lawrence, who lived in Headingley, died two days after the attack on two women, inquest hears. Scientists test Mounjaro and Wegovy - the big beasts of weight loss medication - to see which is best. A council is criticised for a sex education presentation that was intended to be used in schools.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:11.745316"
  },
  {
    "url": "https://www.bbc.com/news/world/africa",
    "title": "Africa | Latest News & Updates | BBC News",
    "body": "Capt Ibrahim Traoré, 37, is portraying himself as a champion of pan-Africanism. A fierce advocate of African art, she was due to become the first African woman to lead the Venice Biennale. The Doctor will be transported to Lagos in the first ever episode set primarily in an African country. Reports say the first set of white South Africans could arrive in the US next week. A selection of the week's best photos from across the African continent and beyond. A fierce advocate of African art, she was due to become the first African woman to lead the Venice Biennale. Lesego Chombo tells the BBC she was appointed by the president before he had even met her. The city, which has escaped the worst of the civil war, has been targeted in a series of bombardments. The Doctor will be transported to Lagos in the first ever episode set primarily in an African country. Why ex-bank boss Tidjane Thiam has been barred from seeking the Ivorian presidency - and the potential fallout.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:12.464273"
  },
  {
    "url": "https://www.bbc.com/news/world/asia",
    "title": "Asia | Latest News & Updates | BBC News",
    "body": "US Treasury Secretary Scott Bessent says both countries will lower their reciprocal tariffs by 115% for 90 days. The midterms will impact the future of President Marcos and his rival and VP, Sara Duterte. The eldest daughter of the Philippines' ex-leader Rodrigo Duterte, Sara, is no stranger to controversy.  The US treasury secretary calls the talks \"productive\", while China's vice premier describes them as \"candid\". The suspects are accused of attempting to smuggle 160kg of live crabs out of Japan. The midterms will impact the future of President Marcos and his rival and VP, Sara Duterte. Both nations have ceased hostilities since the announcement of the ceasefire on Saturday but say they remain vigilant. The midterms are a test for President Marcos, the son of an ousted dictator who made a comeback in 2022. The eldest daughter of the Philippines' ex-leader Rodrigo Duterte, Sara, is no stranger to controversy.  Chess will be suspended until religious considerations are addressed, a spokesman said. ",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:13.095079"
  },
  {
    "url": "https://www.bbc.com/news/world/australia",
    "title": "Australia | Latest News & Updates | BBC News",
    "body": "Robin Reed and his son Owen were swept out to sea at a popular tourist beach in Queensland. Cassius Turvey was chased through bush and beaten with a metal pole, in a case which sparked national outrage. The state government will invest A$65m to set up and support the new club over the next seven years. Ian Wilkinson was left seriously ill after the meal, which led to the deaths of his wife and two relatives. The US president also described election winner Anthony Albanese as \"a friend of mine\". Cassius Turvey was chased through bush and beaten with a metal pole, in a case which sparked national outrage. Adam Bandt was ousted by a \"riptide\" of swing votes, which he blamed on the so-called Trump effect. It was the opposition leader's home state that delivered Labor its win, with the red wave taking out his own seat. The state government will invest A$65m to set up and support the new club over the next seven years. Donald Trump loomed large over the election, with comparisons drawn between the US president and defeated opposition leader Peter Dutton.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:13.685097"
  },
  {
    "url": "https://www.bbc.com/news/world/europe",
    "title": "Europe | Latest News & Updates | BBC News",
    "body": "\"I will be waiting for Putin in Türkiye on Thursday. Personally,\" the Ukrainian leader writes after Trump urged him to \"have the meeting, now!\" This was clearly his response to the ultimatum set by European leaders in Kyiv, the BBC's Russia Editor writes. Twenty-five fans are hospitalised, including one with life-threatening injuries, after a pitch invasion in Hamburg on Saturday. The city at the crossroads of France, Germany and Switzerland gears up amid global tensions over diversity and inclusion. A salvage operation is under way to recover the Bayesian which sank off the Italian coast last August. This was clearly his response to the ultimatum set by European leaders in Kyiv, the BBC's Russia Editor writes. Donald Tusk says the massive Warsaw blaze was \"for sure\" ordered by the Russian special services. The pontiff calls for a \"lasting peace\" in Ukraine and says he is \"deeply hurt\" by events in Gaza. Twenty-five fans are hospitalised, including one with life-threatening injuries, after a pitch invasion in Hamburg on Saturday. Christian Brückner is the prime suspect in Madeleine McCann's disappearance in Portugal in 2007.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:14.254310"
  },
  {
    "url": "https://www.bbc.com/news/world/latin_america",
    "title": "Latin America | Latest News & Updates | BBC News",
    "body": "Many children in a Brazil town lost the ability to walk, so one scientist set about discovering why. President Sheinbaum argues Trump's executive order applies only to the US portion of the continental shelf.  The politicians, who had been sheltering at the Argentinian embassy in Caracas for over a year to avoid arrest, are now on US soil.\n\n A local prosecutor says there is a \"war\" raging in the area between illegal and legal gold miners.  The mayor of Teuchitlán is suspected of colluding with the New Generation Jalisco Cartel, which he denies.  President Sheinbaum argues Trump's executive order applies only to the US portion of the continental shelf.  Robert Prevost is a source of pride for many Peruvians, who say he represents their country. Argentine Franco Colapinto will drive for Alpine for the next five grands prix, replacing Jack Doohan. The politicians, who had been sheltering at the Argentinian embassy in Caracas for over a year to avoid arrest, are now on US soil.\n\n The South American country is turning to wind power, but some local people are unhappy.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:14.945651"
  },
  {
    "url": "https://www.bbc.com/news/world/middle_east",
    "title": "Middle East | Latest News & Updates | BBC News",
    "body": "Alexander, believed to be the last living captive with US nationality in Gaza, was taken by Hamas during the 7 October attacks. Edan Alexander, 21, is believed to be the last living captive with US nationality in Gaza. Iran's Foreign Minister Abbas Araqchi described the negotiations as \"difficult but useful\".  As the president goes to Saudi Arabia, Qatar and the UAE he wants them to buy more from the States. UN agencies say they will not co-operate with the proposed system because it appears to \"weaponise\" aid. Edan Alexander, 21, is believed to be the last living captive with US nationality in Gaza. Veterans who served with the SAS and SBS give BBC Panorama eyewitness accounts of alleged executions.  Israeli settler Moshe Sharvit established a so-called 'outpost'  in occupied West Bank Iran's Foreign Minister Abbas Araqchi described the negotiations as \"difficult but useful\".  The action, which affects hundreds of Palestinian pupils, comes after an Israeli ban on Unrwa this year.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:15.562820"
  },
  {
    "url": "https://www.bbc.com/news/in_pictures",
    "title": "In Pictures | Latest News & Updates | BBC News",
    "body": "A selection of the week's best photos from across the African continent and beyond. Events are taking place across the UK to mark the 80th anniversary of the end of World War Two in Europe. Photos show the disruption caused by power cuts that have affected large parts of Spain and Portugal. Sony Photography Awards winner explores the tension between artificial spaces and environmental destruction. A Palestinian child coping with amputation and a young Ukrainian girl traumatised by war are among the winning images. Events are taking place across the UK to mark the 80th anniversary of the end of World War Two in Europe. Commemorations opened with a military procession and flypast watched by WW2 veterans, royals and huge crowds, and ended with tea parties around the country. A selection of the week's best photos from across the African continent and beyond. Photos show the disruption caused by power cuts that have affected large parts of Spain and Portugal. The site is littered with awful photos, particularly of celebrities - but a volunteer project is trying to fix that.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:16.551743"
  },
  {
    "url": "https://www.bbc.com/news/bbcindepth",
    "title": "BBC InDepth - In depth and expert analysis from BBC News",
    "body": "Troop numbers are down, morale is weak and some equipment is in a poor state - will the government's Strategic Defence Review be enough to turn that around? Home Secretary Yvette Cooper is set to release her White Paper called \"Restoring Control Over the Immigration System\". It suggests the party was particularly popular among those who voted for Brexit in 2016 and for Boris Johnson in 2019. To many, the close relationship between the US and Israel seems permanent and unshakeable. The next General Election is miles away and parties can surge and sink, but this week's results show Farage has changed the race, writes Laura Kuenssberg. Foreign policy is rarely a big factor in Australia's poll - but the US president has changed that. It suggests the party was particularly popular among those who voted for Brexit in 2016 and for Boris Johnson in 2019. Exclusive: The former president tells Nick Robinson his verdict on his successor's first 100 days and his \"grave concern\" for the future of the Atlantic Alliance Pope Francis's efforts to shake up the workings of the Church should be built on by the next pope, according to some - but his critics are less convinced To many, the close relationship between the US and Israel seems permanent and unshakeable.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:17.174126"
  },
  {
    "url": "https://www.bbc.com/news/bbcverify",
    "title": "BBC Verify | Latest News & Updates | BBC News",
    "body": "BBC Verify has debunked videos which purport to show Pakistani attacks on Indian bases and jets crashing. BBC Verify tracks a man accused of selling places on a migrant boat which left dozens dead after getting lost at sea. BBC Verify has looked into some of the claims made by the US president during his speech in Michigan. BBC Verify has looked at the agency's biggest claimed savings, examining the figures and speaking to experts. As Ukraine reckons with the terms of a possible peace deal, BBC Verify asks what it could mean in practice. BBC Verify tracks a man accused of selling places on a migrant boat which left dozens dead after getting lost at sea. As Ukraine reckons with the terms of a possible peace deal, BBC Verify asks what it could mean in practice. Russian authorities are systematically seizing thousands of homes from Ukrainian residents who fled Mariupol, a BBC Verify investigation finds. A look behind the investigation by BBC Verify's Olga Robinson and Christine Jeavans into the seized homes of Mariupol.  Some 175 tents raised as part of an expansion to the base's migrant detention centre have been removed.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:17.794136"
  },
  {
    "url": "https://www.bbc.com/news/politics",
    "title": "Politics | Latest News & Updates | BBC News",
    "body": "Proposed changes include English tests and cuts to recruitment of overseas care workers, as Tory leader Kemi Badenoch says Labour \"can't be trusted\" to protect UK borders. The government says its proposals will reduce record levels of migration to the UK in recent years. Many care workers say it is a rewarding job, so the task is how to get more people in the UK to apply. Green Party co-leader Adrian Ramsay and MP Ellie Chowns join forces in a bid for the leadership. Troop numbers are down, morale is weak and some equipment is in a poor state - will the government's Strategic Defence Review be enough to turn that around? The government says its proposals will reduce record levels of migration to the UK in recent years. While the focus is on legal immigration, it is expected that ministers will discuss illegal immigration.\n Sir Keir Starmer promises new migration rules will \"create a system that is controlled, selective and fair\". Many care workers say it is a rewarding job, so the task is how to get more people in the UK to apply. Up to 50,000 fewer lower-skilled workers will come to the UK under new measures aimed at tackling net migration, the home secretary says.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:18.421990"
  },
  {
    "url": "https://www.bbc.com/news/england",
    "title": "England | Latest News & Updates | BBC News",
    "body": "Eli Sweeting was reported missing on 4 May after failing to return from a solo hike.  Ex-Rochdale footballer Joe Thompson died in April aged 36, a year after his third cancer diagnosis. \"It doesn't make Cornwall a very welcoming place,\" says councillor Kate Ewert. A 19-year-old arrested after the boy was struck in a field has been released under investigation. Castle Hill Club in Lincoln has decided to continue to not allow women to become members. Ex-Rochdale footballer Joe Thompson died in April aged 36, a year after his third cancer diagnosis. Owen Lawrence, who lived in Headingley, died two days after the attack on two women, inquest hears. Lucas, 13, from Stoke-on-Trent, has regular seizures and needs around the clock care. \"It doesn't make Cornwall a very welcoming place,\" says councillor Kate Ewert. Tony Dixon was suspended after mesh surgery was found to have caused harm to hundreds of patients.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:19.019739"
  },
  {
    "url": "https://www.bbc.com/news/northern_ireland",
    "title": "Northern Ireland | Latest News & Updates | BBC News",
    "body": "Emmanuel Familola and Matt Sibanda died after getting into difficulty in the water in County Donegal It comes following the death of Garda Kevin Flatley, 49, on Sunday whilst carrying out a speed checkpoint in County Dublin. The estimated costs of accommodation for asylum seekers in Northern Ireland has risen to £400m. The surrender of the German U-boats is remembered by a Derry man who was there 80 years ago. Shane Lowry misses out on victory at the Truist Championship as his European Ryder Cup team-mate Sepp Straka claims the title. It comes following the death of Garda Kevin Flatley, 49, on Sunday whilst carrying out a speed checkpoint in County Dublin. There are calls for improving biodiversity in social housing to be supported by the government. Blue Lights beat BBC One's Sherwood, Netflix's Supacell and BBC One's Wolf Hall: The Mirror And The Light. The estimated costs of accommodation for asylum seekers in Northern Ireland has risen to £400m. People who cannot afford to pay for their healthcare upfront are going to suffer under a new reimbursement scheme, a senior medic has said.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:19.622992"
  },
  {
    "url": "https://www.bbc.com/news/northern_ireland/northern_ireland_politics",
    "title": "Northern Ireland Politics | Latest News & Updates | BBC News",
    "body": "A complaint had been lodged by Age NI after some of its staff appeared before the committee last October. First Minister Michelle O'Neill was among those who attended on the day of the unveiling. Judges told the NI secretary to reconsider a decision not to hold an inquiry into the GAA official's murder. Concerns continue to rise about the supply of veterinary medicines in Northern Ireland post-Brexit. Northern Ireland's Equality Commission aims to publish new formal guidance. First Minister Michelle O'Neill was among those who attended on the day of the unveiling. It comes as Fermanagh and Omagh Council says it is \"developing guidance\" around the use of same-sex female facilities. The Foyle MP is one of four people charged with taking part in an unnotified parade in February 2024. Judges told the NI secretary to reconsider a decision not to hold an inquiry into the GAA official's murder. Caoimhe Archibald said the new legislation would put an end to \"exploitative\" zero hours contracts.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:20.187994"
  },
  {
    "url": "https://www.bbc.com/news/scotland",
    "title": "Scotland | Latest News & Updates | BBC News",
    "body": "The deputy first minister has criticised Prime Minister Sir Keir Starmer's plans to cut net migration. Researchers in Edinburgh have developed a shoe that will help people with MS, cerebral palsy or strokes. Duror Primary in the Highlands has been saved after locals campaigned to stop its planned closure. Susan Shepherd, 75, was devastated at the loss of items such as her late husband's wedding band. Starmer's plans to reform UK immigration rules and the Bafta television awards make the front pages. Researchers in Edinburgh have developed a shoe that will help people with MS, cerebral palsy or strokes. Margaret McGowan died after being found seriously injured in Nitshill on Saturday night.  Police say the biker was among several people caught at speeds of 90mph and above in the Highlands. Duror Primary in the Highlands has been saved after locals campaigned to stop its planned closure. Find out all the backstage drama from this year's Bafta TV awards.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:20.820606"
  },
  {
    "url": "https://www.bbc.com/news/scotland/scotland_politics",
    "title": "Scotland Politics | Latest News & Updates | BBC News",
    "body": "The deputy first minister has criticised Prime Minister Sir Keir Starmer's plans to cut net migration. MSPs will vote this week on whether or not to allow terminally ill adults to seek medical help to end their lives. Emma Bryson feels \"vindicated\" knowing changes to the law she helped effect could have given her own case a different outcome.  The Central Scotland MSP said she believes she can deliver great election results if elected. Legislation to allow terminally ill people in Scotland to take their own life is being put forward by the Liberal Democrat MSP Liam McArthur. MSPs will vote this week on whether or not to allow terminally ill adults to seek medical help to end their lives. The former first minister said there were not enough safeguards protecting vulnerable people ahead of a vote at Holyrood next week. The move follows the UK Supreme Court's landmark ruling over the definition of a woman. Emma Bryson feels \"vindicated\" knowing changes to the law she helped effect could have given her own case a different outcome.  Scottish ministers say in future it will be run with a focus on  public service rather than a having a commercial ethos. ",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:21.474732"
  },
  {
    "url": "https://www.bbc.com/news/wales",
    "title": "Wales | Latest News & Updates | BBC News",
    "body": "A council is criticised for a sex education presentation that was intended to be used in schools. Robin Reed and his son Owen were swept out to sea at a popular tourist beach in Queensland. Kathryn Nicklas said embarrassment as a teenager meant she had struggled to advocate for herself. Michael became unwell after visiting a farm now being investigated over an outbreak of cryptosporidium. Athrun, 16, was last seen on West Shore Beach in Llandudno on Saturday wearing only swim shorts. Robin Reed and his son Owen were swept out to sea at a popular tourist beach in Queensland. Ruth Jones, writer and actress of Gavin Stacey, says her Bafta win for playing Nessa is \"immense\". Shia Labeouf, Toby Kebell and Michael Socha star in the boxing drama filmed in Barry and Penarth.  Kathryn Nicklas said embarrassment as a teenager meant she had struggled to advocate for herself. A yellow warning has been issued for thunderstorms and floods, despite the UK experiencing its driest spring for nearly 70 years.",
    "published_date": null,
    "author": "BBC News Staff",
    "source": "BBC News",
    "scraped_at": "2025-05-12T10:56:22.140013"
  }
]